Repository: 84000/data-translation-memory
Catalog: Toh_96-The_Miraculous_Play_of_Manjusri-v2.tmx
Source language: bo
Languages: en

source: ཁྱེའུ་དེས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཉི་མའི་དཀྱིལ་འཁོར་འཆར་བ་དང་འདྲ་བ་གཟི་བརྗིད་དང་དཔལ་གྱིས་འབར་བ། མཛེས་པ་དགའ་བར་བྱ་བ། དབང་པོ་ཞི་བ། ཐུགས་ཞི་བ། དུལ་བ་མཆོག་མཚུངས་པ་མེད་པ། དམ་པའི་མཆོག་བརྙེས་པ། གསེར་གྱི་མཆོད་སྡོང་ལྟར་མངོན་དུ་འབར་བ། གླང་པོ་ཆེ་ལྟར་དབང་པོ་ཐུལ་ཅིང་བསྲུངས་པ། མཚོ་ལྟར་དང་ཞིང་གསལ་ལ་རྙོག་པ་མེད་པ། སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་བརྒྱན་པ། ཉན་ཐོས་ཀྱི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ནས་ཆོས་སྟོན་ཅིང་བཞུགས་པར་རྒྱང་རིང་པོ་ནས་མཐོང་ངོ་། །
en: The boy saw the Tathāgata, the Worthy One, the Perfectly Awakened One, from a distance, looking like the orb of the rising sun, burning with heat and beauty, bringing glory and happiness, with his senses calmed, with his mind calmed, well trained, incomparable, having obtained the highest truth, shining like a sacrificial pillar of gold, with his senses guarded and controlled like those of an elephant, clear and shining, not turbid like the sea, adorned with the thirty-two characteristics of a great man, surrounded by his disciples, and teaching the Dharma.

source: དེའི་ལམ་བཀྲ་བ་བལྟ་ན་སྡུག་པ། རིན་པོ་ཆེའི་ལན་ཀན་བྲེས་པ། མེ་ཏོག་བཀྲམ་པ་ཞིག་ཀྱང་བྱུང་བར་གྱུར་ཏོ། །
en: The path upon which he was walking was variegated and beautiful to behold, a railing of gems was set up, and flowers were scattered all around.

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ཡང་ཁྱེའུ་དེའི་མདུན་དུ་འགྲེང་ནས་ཁྱེའུ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Then Śakra, the king of the gods, appeared before the boy and addressed him:

source: ཁྱེའུ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་མཐོང་ནས་སེམས་རབ་ཏུ་དང་བར་གྱུར་པ་ནི། རྙེད་པ་ལེགས་པར་རྙེད་པ་ཡིན་ནོ། །
en: “Boy, now that you have seen the Tathāgata, your mind will be at ease, and that is truly a great attainment.

source: དེ་བཞིན་གཤེགས་པ་ཡང་ཁྱོད་ཉིད་ལ་དགོངས་ཀྱིས། ཁྱེའུ་ཁྱོད་ལམ་འདིར་ཞུགས་ལ་དེ་བཞིན་གཤེགས་པའི་སྤྱན་སྔར་སོང་ཤིག །
en: The Tathāgata is thinking of you, boy, so set out on this road and go to the Tathāgata!”

source: དེ་ནས་ཁྱེའུ་དེ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་ངོ་། །
en: So the boy went with Śakra, the king of the gods, to the Blessed One,

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཁྱེའུ་དེ་ལ། ཁྱེའུ་ཁྱོད་ཀྱིས་མེ་ཏོག་འདི་དག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་མངོན་པར་གཏོར་ཅིག་ཅེས་མེ་ཏོག་མན་དཱ་ར་བ་ཐུ་བ་གང་བྱིན་ནོ། །
en: and Śakra, the king of the gods, gave the boy some mandārava flowers, saying, “Boy, you should scatter these over the Tathāgata.”

source: དེ་ནས་ཁྱེའུ་དེས་མེ་ཏོག་དེ་དག་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་གཏོར་ཏོ། །
en: At this, the boy scattered the flowers over the Blessed One.

source: གཏོར་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་གསུམ་བསྐོར་བ་བྱས་ནས་
en: When he had done this, he bowed his head to the Blessed One’s feet and circumambulated him three times.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་སྟེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then he sat down before the Blessed One and addressed him with the following words:

source: བདག་བཅོམ་ལྡན་འདས་དང་། ཆོས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་སྐྱབས་སུ་མཆིའོ། །
en: “Blessed One, I take my refuge in the Blessed One, his Dharma, and his Community, and

source: བདག་གི་དགེ་བའི་རྩ་བ་འདི་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་བགྱིའོ། །
en: I dedicate my root of virtue toward complete awakening.

source: བཅོམ་ལྡན་འདས་བདག་གིས་ཡུལ་གྱི་བཟང་མོ་རྒྱལ་པོས་ཐུགས་སུ་ཆུད་པ་གསེར་མཆོག་འོད་དཔལ་ཞེས་བགྱི་བ་ཞིག་དགའ་བར་རྩེ་བའི་སླད་དུ་སྐྱེད་མོས་ཚལ་དུ་ཁྲིད་པ་ལས། བཅོམ་ལྡན་འདས་དེ་མདོག་ཡལ་ཞིང་ལུས་མྱགས་ཏེ་
en: Blessed One, I led this famously beautiful girl Suvarṇottama­prabhāśrī, who was approached even by kings, to the park to have fun and pleasure with her, but suddenly she lost all of her color and her body started to rot.

source: ཉེ་དུའི་ཚོགས་ཐམས་ཅད་ཀྱིས་ཀྱང་སྤངས་ནས་བདག་ཀྱང་འཇིགས་པ་ཆེན་པོ་སྐྱེས་ན
en: As all my companions have left me, I have become very frightened.

source: བཅོམ་ལྡན་འདས་འདིའི་ལེ་ལན་གྱིས་བདག་རྒྱལ་པོས་བཀུམ་དུ་མ་མཆིས་ལགས་སམ།
en: Blessed One, will the king not execute me as punishment for this?”

source: ཁྱེའུ་མ་དོགས་ཤིག །
en: “My boy, have no doubt.

source: སངས་རྒྱས་ལ་སྐྱབས་སུ་སོང་བ་རྣམས་ལ་འཇིགས་པ་ཕྱིས་མི་འབྱུང་བས། ངས་ཁྱོད་མི་འཇིགས་པས་མགྲོན་དུ་གཉེར་གྱིས་འཇིགས་པ་མ་བསྐྱེད་ཅིག །
en: Fear no longer arises in those who have taken their refuge in the Buddha, so as I have invited you here by means of the absence of fear, have no fear!

source: ཁྱེའུ་དེ་ལྟ་མོད་ཀྱི་གཞི་གང་ལས་འཇིགས་པ་དང་སྐྲག་པར་གྱུར་པའི་གཞི་དེ་ཡོངས་སུ་སྤོངས་ཤིག །
en: Instead, give up the cause from which fear and terror arise.”

source: གསོལ་པ་བཅོམ་ལྡན་འདས། འཇིགས་སྐྲག་པར་འགྱུར་བའི་གཞི་གང་ལགས།
en: “Blessed One, what is the cause of fear and terror?” asked the boy.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཁྱེའུ་འདོད་ཆགས་དང་ཞེ་སྡང་དང་། གཏི་མུག་ནི་འཇིགས་པ་དང་སྐྲག་པར་འགྱུར་བའི་གཞིའོ། །
en: “Desire, aversion, and bewilderment are the cause of fear and terror, my boy,” replied the Blessed One.

source: ངའོ་སྙམ་པའི་ང་རྒྱལ་ནི་གཞིའོ། །
en: “The arrogance of thinking ‘I am’ is the cause.

source: ལྟ་བའི་ཀུན་ནས་ལྡང་བ་ནི་གཞིའོ། །
en: Being obsessed with doctrinal viewpoints is the cause.

source: སྲེད་པས་ལྷག་པར་ཆགས་པ་ནི་གཞིའོ། །
en: Attachment caused by thirst is the cause.

source: ངར་འཛིན་པ་དང་ང་ཡིར་འཛིན་པ་ནི་གཞིའོ། །
en: Egotism and self-centered ideas are the cause.

source: དངོས་པོ་ལ་མངོན་པར་ཞེན་པ་ནི་གཞིའོ། །
en: Attachment to things is the cause.

source: ཡོངས་སུ་འཛིན་པ་དང་རྩོད་པ་ནི་གཞིའོ། །
en: Possessions and quarreling are the cause.

source: འཇིག་ཚོགས་ལ་ལྟ་བའི་འཆིང་བ་ནི་གཞིའོ། །
en: The fetter of viewing things as substantial and real is the cause.

source: མི་རྟག་པ་ལ་རྟག་པར་འདུ་ཤེས་པ་ནི་གཞིའོ། །
en: Seeing the impermanent as permanent is the cause.

source: སྡུག་བསྔལ་བ་ལ་བདེ་བར་འདུ་ཤེས་པ་ནི་གཞིའོ། །
en: Seeing suffering as happiness is the cause.

source: མི་སྡུག་པ་ལ་སྡུག་པར་འདུ་ཤེས་པ་ནི་གཞིའོ། །
en: Seeing the ugly as beautiful is the cause.

source: བདག་མེད་པ་ལ་བདག་ཏུ་འདུ་ཤེས་པ་ནི་གཞིའོ། །
en: Seeing no-self as self is the cause.

source: ཕུང་པོ་རྣམས་ལ་ཡོངས་སུ་འཛིན་པའི་འདུ་ཤེས་ནི་གཞིའོ། །
en: The idea that there is something to hold on to among the aggregates is the cause.

source: ཁམས་རྣམས་ལ་སོ་སོར་མི་རྟོག་པ་ནི་གཞིའོ། །
en: Lack of insight into the sensory elements is the cause.

source: སྐྱེ་མཆེད་རྣམས་ཡོངས་སུ་མི་ཤེས་པ་ནི་གཞིའོ། །
en: Absence of knowledge of the sense sources is the cause.

source: ལུས་ལ་སྐྱོན་དུ་མི་ལྟ་བ་ནི་གཞིའོ། །
en: Not seeing the defects of the body is the cause.

source: སྲོག་ལ་མངོན་པར་དགའ་བ་ནི་གཞི་སྟེ།
en: Enjoyment of life is the cause.

source: ཁྱེའུ་གཞི་དེ་དག་ལས་འཇིགས་པ་དང་སྐྲག་པ་འབྱུང་བས་དེ་དག་སྤང་བར་བྱའོ། །
en: Fear and terror arise from these causes, and so they should be done away with.

source: ཁྱེའུ་ཁྱོད་ཀྱིས་བུ་མོ་དེའི་ལུས་རྣམ་པར་ཞིག་པ་མཐོང་ངམ།
en: “My boy, do you see the perished body of this girl?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་གིས་མཐོང་ལགས་སོ། །
en: “Blessed One, I see it,” replied the boy.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཁྱེའུ་འདུས་བྱས་ཐམས་ཅད་ནི་དེ་ལྟར་མི་རྟག་པ། སྡུག་བསྔལ་བ། བདག་མེད་པ།
en: “My boy,” said the Blessed One, “all composite things are like this: impermanent, filled with suffering, and without self.

source: རྣམ་པར་འགྱུར་བའི་ཆོས་ཅན། མི་བརྟན་པ། ཐེར་ཟུག་མ་ཡིན་པ།
en: They are always changing and unstable, without permanence.

source: བྱིས་པ་འདྲིད་པ།
en: They deceive foolish people.

source: ལོག་པ་ལས་བྱུང་བ།
en: They arise from falseness.

source: གཡོ་བ་མེད་པ། རྣམ་པར་བསྒྲུབས་པ་སྟེ།
en: They are without activity, and their establishment is illusory.

source: མེད་པ་ལས་སྣང་བས་སྒྱུ་མ་ལྟ་བུའོ། །
en: They are like an illusion because they are manifested from nothing.

source: རོ་མྱང་བ་ཆུང་བས་རྨི་ལམ་ལྟ་བུའོ། །
en: They are like a dream because they provide a limited kind of enjoyment.

source: འཁྲུལ་པར་སྣང་བས་སྨིག་རྒྱུ་ལྟ་བུའོ། །
en: They are like a mirage because they manifest out of bewilderment.

source: གཟོད་མ་ནས་མ་སྐྱེས་པས་མིག་ཡོར་ལྟ་བུའོ། །
en: They are like a visual distortion because they have never arisen in the first place.

source: ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ཆུད་མི་ཟ་བའི་ཚུལ་གྱིས་གཟུགས་བརྙན་ལྟ་བུའོ། །
en: They are like a reflection because actions culminate in their effects.

source: འཕོ་བ་མེད་པའི་ཚུལ་གྱིས་ཆུ་ཟླ་ལྟ་བུའོ། །
en: They are like the reflection of the moon in water because there is no movement.

source: སྒྲ་མེད་པ་ལས་སྒྲར་གོ་བར་བྱེད་པས་བྲག་ཅ་ལྟ་བུའོ། །
en: They are like an echo because sound is produced from the soundless.

source: མངོན་པར་འདུ་བྱེད་པ་མེད་པའི་སྒོ་ཡིན་པས་གྲིབ་མའི་གཟུགས་ལྟ་བུའོ། །
en: They are like shadow images because they are the gate of the non-conditioned.

source: རང་བཞིན་གྱིས་ཡ་མ་བརླ་ཡིན་པས་ཆད་པ་སྟོང་པ་ལྟ་བུའོ། །
en: They are like an empty fist because they are empty of any essential nature.

source: གཟུང་དུ་མེད་པའོ། །རླུང་དང་མཚུངས་པའོ། །
en: They are like the wind because they cannot be held on to.

source: བརྫུན་པའོ། །གཞི་མེད་པའོ། །གསོག་གོ། །
en: They are false, without support, and without purpose.

source: འགྲིབ་པ་མེད་པའོ། །རྫོགས་པ་མེད་པའོ། །
en: They do not diminish or increase.

source: ཁྱེའུ་དེ་ལྟར་ན་ཆོས་ཐམས་ཅད་བདག་པོ་མེད་པ་སྟེ། དེ་ལ་ཁྱོད་མངོན་པར་ཞེན་པར་མི་བྱའོ། །
en: In this way, my boy, all phenomena are without a controlling self, and you should not be attached to them.

source: ཁྱེའུ་དེ་ཇི་སྙམ་དུ་སེམས།
en: What do you think then, my boy?

source: ཁྱོད་ཀྱི་འདོད་པ་དང་ལྡན་པའི་རྟོག་པ་དང་དཔྱོད་པ་གང་ཡིན་པ་དེ་དག་ཇི་ལྟར་མཐོང་།
en: How do you view the thoughts and reflections connected to your desire?”

source: ཁྱེའུས་གསོལ་པ། བཅོམ་ལྡན་འདས་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱི་འདོད་ཆགས་ནི་ཁ་དོག་དང་དབྱིབས་བཟང་པོ་ལས་ཡོངས་སུ་བརྟགས་པས་སྐྱེ་ལགས་སོ། །
en: “The desire of childish, ordinary people arises from imagining a beautiful complexion and bodily form,” answered the boy.

source: དེ་ནི་འཕགས་པའི་ཆོས་འདུལ་བས་མི་གཙང་བ་ལ་སོགས་པར་སོ་སོར་བརྟགས་པས་མི་འབྱུང་སྟེ
en: “It does not arise when they contemplate impurity, and so on, as found in the discipline of the noble Dharma.

source: བཅོམ་ལྡན་འདས་དེ་ལས་མི་རྟོག་ན་འདོད་ཆགས་ཀྱི་ཀུན་འབྱུང་བ་ཀུན་ཏུ་འབྱུང་བར་མི་འགྱུར་ལགས་སོ། །
en: Blessed One, if one does not generate concepts of desire, its origin does not arise.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཁྱེའུ་ལེགས་སོ་ལེགས་སོ། །
en: “Very good! Very good, my boy!” said the Blessed One.

source: འདི་ལྟ་སྟེ།
en: “This is how it is:

source: མི་རྟོག་ཅིང་རྣམ་པར་མི་རྟོག་པ་འདི་ནི་འདོད་ཆགས་ཀྱི་རང་བཞིན་ཡིན་ནོ། །
en: the essential nature of desire is to not generate concepts and thoughts.

source: ཁྱེའུ་ཁྱོད་ཀྱིས་བདག་ཏུ་ལྟ་བ་མེད་པ་དང་། གཞན་དུ་ལྟ་བ་མེད་པ་དང་། གཞན་དུ་ལྟ་བར་སྒྲོ་འདོགས་པ་མེད་པར་ཆོས་ལ་ཚུལ་བཞིན་དུ་སེམས་པར་བརྩོན་པར་བྱའོ། །
en: So, my boy, you should strive to have the correct ideas concerning phenomena regarding not viewing them as self, not viewing them as other, and not superimposing on them any other views.”

source: ཁྱེའུས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ལ་ཚུལ་བཞིན་དུ་སེམས་པར་བརྩོན་པ་ལགས།
en: “But Blessed One, how does the bodhisatva strive to have the correct ideas concerning phenomena?” asked the boy.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཁྱེའུ་བྱང་ཆུབ་སེམས་དཔའ་ནི་འདོད་ཆགས་ཀྱི་རང་བཞིན་གྱིས་བྱང་ཆུབ་ཡོངས་སུ་ཚོལ་ལོ། །
en: “My boy,” replied the Blessed One, “the bodhisatva seeks awakening by means of the essence of desire.

source: ཁྱེའུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཞེ་སྡང་གི་རང་བཞིན་དང་། གཏི་མུག་གི་རང་བཞིན་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱི་རང་བཞིན་གྱིས་བྱང་ཆུབ་ཡོངས་སུ་ཚོལ་ལོ། །
en: My boy, the bodhisatva seeks awakening by means of the essence of aversion, the essence of bewilderment, and the essence of all the afflicted mental states.

source: ཁྱེའུ་ཇི་ལྟར་འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་དངོས་པོ་མེད་པ་དེ་ལྟར་ཆོས་ཐམས་ཅད་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཤེས་པ་འཇུག་གོ། །
en: “My boy, desire, aversion, and bewilderment are insubstantial, and the bodhisatva’s entrance into knowledge is in accord with this.

source: ཁྱེའུ་འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་རྣམས་ནི་རྩ་བ་མེད་པ། གནས་མེད་པ། གཞི་མེད་པ། བྱེད་པ་པོ་མེད་པ། ཚོར་བ་པོ་མེད་པ།
en: “My boy, desire, aversion, and bewilderment have no root, no dwelling place, no foundation, and no subject that acts or feels.

source: ནང་དང་ཕྱི་རོལ་དབེན་པ།
en: They are beyond the dichotomy of inner and outer.

source: སྟོང་པ། བདག་དང་། སེམས་ཅན་དང་། སྲོག་དང་། གསོ་བ་དང་། སྐྱེས་བུ་དང་། གང་ཟག་དང་བྲལ་བ་མཚན་མ་མེད་པ་སྟེ།
en: They are empty, without a self, being, life principle, soul, person, or personality.

source: མཚན་མར་རྟོག་པ་དང་བྲལ་བ། སྨོན་པ་མེད་པ། མངོན་པར་དགའ་བ་མེད་པ། དགའ་བ་དང་། སྲེད་པ་དང་བྲལ་བ། མངོན་པར་འདུ་བྱེད་པ་མེད་པ། རང་བཞིན་མེད་པའོ། །
en: They have no distinguishing marks, no construction of distinguishing marks, no wishes, no pleasure, no passion, no thirst, and no conditioning.

source: ཁྱེའུ་འདོད་ཆགས་དང་ཞེ་སྡང་དང་། གཏི་མུག་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཤེས་པ་འཇུག་གོ། །
en: “My boy, desire, aversion, and bewilderment are unborn, and the bodhisatva’s entrance into knowledge is in accord with this.

source: ཁྱེའུ་གཞན་ཡང་ཚུལ་བཞིན་ལ་བརྩོན་པའི་བྱང་ཆུབ་སེམས་དཔའི་སེམས་བསྐྱེད་པ་ཐམས་ཅད་ནི་བྱང་ཆུབ་ཡིན་ནོ། །
en: “Further, my boy, all the thoughts of the bodhisatva who practices genuinely are awakening.

source: སེམས་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་བསྟན་དུ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། རྣམ་པར་རིག་པ་མེད་པ་དང་།
en: The understanding of thought is beyond demonstration, beyond wishes, beyond information.

source: སྒྱུ་མའི་རང་བཞིན་ལྟ་བུ་དང་། ནང་མ་ཡིན་པ་དང་། ཕྱི་རོལ་མ་ཡིན་པ་དང་།
en: It is like an illusion—not inside, nor outside, nor both.

source: གཞན་དང་ལྡན་པ་མ་ཡིན་པས་གཟུགས་མེད་པ་སྟེ། ཁྱེའུ་དེ་ཉིད་བྱང་ཆུབ་སེམས་དཔའི་བྱང་ཆུབ་ཡིན་ཏེ།
en: It is therefore formless, and that, my boy, is exactly what the awakening of the bodhisatva is.

source: ཁྱེའུ་བྱང་ཆུབ་སེམས་དཔས་རང་གི་སེམས་རྟོགས་པ་མ་གཏོགས་པར་ཁོང་དུ་ཆུད་པར་བྱ་བ་གཞན་ཅི་ཡང་མེད་དོ། །
en: Moreover, my boy, there is nothing that bodhisatvas need to understand apart from their own thoughts.

source: རང་གི་སེམས་རྟོགས་པ་གང་ཡིན་པ་དེ་ཉིད་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་རྟོགས་པ་ཡིན་ནོ། །
en: To understand one’s own thoughts is indeed to understand the thoughts of all beings.

source: རང་གི་སེམས་དབེན་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དབེན་ནོ། །
en: If one’s own thoughts stand aloof, the thoughts of all beings stand aloof.

source: རང་གི་སེམས་ཀྱི་རང་བཞིན་གྱིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་རང་བཞིན་ནོ། །
en: By understanding the essence of one’s own thoughts, one understands the essence of the thoughts of all beings.

source: རང་གི་སེམས་རྣམ་པར་དག་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་རྣམ་པར་དག་གོ། །
en: If one’s own thoughts are pure, the thoughts of all beings are pure.

source: རང་གི་སེམས་འདོད་ཆགས་དང་བྲལ་བས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་འདོད་ཆགས་དང་བྲལ་ལོ། །
en: If one’s own thoughts are without desire, the thoughts of all beings are without desire.

source: རང་གི་སེམས་ལ་ཞེ་སྡང་མེད་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ལ་ཞེ་སྡང་མེད་དོ། །
en: If one’s own thoughts are without aversion, the thoughts of all beings are without aversion.

source: རང་གི་སེམས་ལ་གཏི་མུག་མེད་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ལ་གཏི་མུག་མེད་དོ། །
en: If one’s own thoughts are without bewilderment, the thoughts of all beings are without bewilderment.

source: རང་གི་སེམས་ལ་ཉོན་མོངས་པ་མེད་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ལ་ཉོན་མོངས་པ་མེད་དོ། །
en: If one’s own thoughts are without afflicted mental states, the thoughts of all beings are without afflicted mental states.

source: དེ་ལྟར་རྟོགས་པ་གང་ཡིན་པ་དེ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་རྟོགས་པ་ཡིན་ནོ།
en: This understanding is the understanding of omniscience.

source: ཁྱེའུ་དེ་ལྟར་ཚུལ་བཞིན་ལ་བརྩོན་པའི་བྱང་ཆུབ་སེམས་དཔས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ལ་རང་བཞིན་གྱིས་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པར་རབ་ཏུ་ཤེས་སོ། །
en: “Thus, my boy, the bodhisatva who practices genuinely has acquired the insight that the thoughts of all beings are essentially without afflicted mental states.

source: གང་གློ་བུར་གྱི་ཉོན་མོངས་པས་ཉེ་བར་ཉོན་མོངས་ཀྱང་སེམས་ཀྱི་རྒྱུད་ལ་ནི་ཉོན་མོངས་པར་འགྱུར་བ་ཡང་མེད་ལ། ཆོས་ཀྱི་རིགས་པའི་ལྷག་མཐོང་གིས་དེ་དག་དེ་ལ་ཡོངས་སུ་གདུང་བ་ཡང་མེད་དེ
en: “Moreover, because of their expanded vision that is in accord with the true Dharma, there is no fervent desire in the trains of thought of those who are not stained by afflicted mental states, even though they may occasionally be sullied by adventitious afflicted mental states.

source: དེས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་གློ་བུར་གྱི་ཉོན་མོངས་པ་རྣམས་མཐོང་བས་ན་ཀུན་ནས་ཉོན་མོངས་པར་མི་འགྱུར་རོ། །
en: Thus, those bodhisatvas are not stained by afflicted mental states because they see that afflicted mental states are adventitious.”

source: བསྟན་པ་འདི་བཤད་པ་ན་ཚོང་དཔོན་གྱི་བུ་འཇིགས་བྱིན་ཆོས་རྣམས་ལ་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་སྐྱེས་པར་གྱུར་ཏོ། །
en: When this teaching had been given, the banker’s son Bhayadatta attained patient acceptance that is in accord with all things.

source: དེ་ནས་སྨད་འཚོང་མའི་བུ་མོ་གསེར་མཆོག་འོད་དཔལ་གྱིས། ཚོང་དཔོན་གྱི་བུ་དེ་དུལ་བར་རིག་ནས། ལྷའི་བུ་མོ་ལྔ་བརྒྱ་ཙམ་གྱིས་ཡོངས་སུ་བསྐོར་ཏེ། སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་དང་། གླུ་དབྱངས་ལེན་པ་དག་བྱེད་ཅིང་།
en: The courtesan’s daughter Suvarṇottama­prabhāśrī noticed that the banker’s son Bhayadatta had been educated, and accompanied by about five hundred goddesses she caused cymbals to sound, music to be heard, and songs to be sung.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: She went to the Blessed One,

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: bowed her head to his feet, and

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ། །
en: sat down before him.

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཚོང་དཔོན་གྱི་བུ་འཇིགས་བྱིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Then the princely Mañjuśrī addressed the banker’s son Bhayadatta:

source: ཁྱེའུ་ཁྱོད་ཀྱིས་སྲིང་མོ་འདི་ཤེས་སམ།
en: “My boy, do you know this sister?”

source: སྨྲས་པ། འཇམ་དཔལ་འཚལ་ལགས་སོ། །
en: “Yes, I do,” answered the boy.

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། ཇི་ལྟ་བུར་ཤེས།
en: “What do you know her to be?” asked Mañjuśrī.

source: དེ་ནས་ཁྱེའུ་དེས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Then the boy spoke these verses to the princely Mañjuśrī:

source: གཟུགས་ནི་དབུ་བ་རྡོས་པ་འདྲ། །
en: “Beautiful forms are just like a mass of foam,

source: ཚོར་བ་ཆུ་ཡི་ཆུ་བུར་བཞིན། །
en: Feelings are just like bubbles,

source: འདུ་ཤེས་སྨིག་རྒྱུ་ལྟ་བུ་སྟེ། །
en: Perceptions are like mirages,

source: འདུ་བྱེད་རྣམས་ནི་ཆུ་ཤིང་བཞིན། །རྣམ་ཤེས་སྒྱུ་མ་ལྟ་བུ་སྟེ། །
en: Conditioning is like the soft plantain tree,

source: ཡོངས་སུ་རྟོགས་པས་ཀུན་ཏུ་བསྐྱེད། །
en: “And consciousness is just like an illusion.

source: བྱིས་པས་ཡང་དག་མིན་བརྟགས་པ། །
en: Everything is produced from fantasies And from the nonexistent imaginings of a fool.

source: དེ་ལྟར་བདག་གིས་ཡོངས་སུ་འཚལ། །
en: Thus I know her to be the nonexistent concept of a child.

source: འདི་ལུས་མི་གཡོ་བེམས་པོ་སྟེ། །
en: “Her body itself is inactive.

source: རྩྭ་དང་རྩིག་པ་ལྟ་བུ་ལགས། །
en: It is dead matter, like grass and stones.

source: རྣམ་ཤེས་བསྟན་དུ་མ་མཆིས་ཏེ། །
en: Consciousness is impossible to display.

source: འདི་ལ་སེམས་ཅན་བདག་མ་མཆིས། །སྲོག་དང་གང་ཟག་མ་མཆིས་ཏེ། །
en: “There is no being, no self, no life principle, No person in this body.

source: ལུས་འདི་བསགས་པ་ཙམ་ལགས་པར། །
en: It is just a heap.

source: འདི་ལ་འདོད་ཆགས་སྡང་མ་མཆིས། །གཏི་མུག་འབྱུང་བའང་མ་མཆིས་ཏེ། །ཉོན་མོངས་མ་མཆིས་བདག་མ་མཆིས། །
en: “There is no desire, aversion, or bewilderment, No afflicted mental state And no purification in it.

source: ཚུལ་བཞིན་མ་ལགས་བསླད་པ་འདི། །བྱིས་པ་རྣམས་ཀྱི་འཁྲུལ་པ་སྟེ། །
en: “The childish confusion of fools Is to be found in superficial teachings.

source: མཁས་པ་དེ་ལ་མི་ཆགས་པར། །
en: The wise are not attached to this.

source: དཔེར་ན་འདི་ནི་ནགས་ཁྲོད་ན། །ཤི་བའི་རོ་ནི་མནམ་པ་བཞིན། །གཟུགས་འདི་རང་བཞིན་དེ་འདྲ་བར། །
en: “This form has the same nature As a foul-smelling corpse Rotting away in the jungle.

source: འདི་ནི་སྔོན་མཐར་མ་སྐྱེས་ཏེ། །ཕྱི་མཐར་འཆི་འཕོར་འགྱུར་མ་མཆིས། །ད་ལྟར་བྱུང་བ་མ་མཆིས་པར། །
en: “It is unborn in the beginning, Does not perish in the end, And is nonexistent in the present.

source: འདི་ཡིས་བདག་ནི་རྒྱལ་བ་ལས། །མི་གཙང་བ་ཡིས་བཀྲོལ་བས་ན། །འཇམ་དབྱངས་རྣམ་པ་ཇི་ལྟས་ཀྱང་། །འདི་ལ་ལན་གླན་རྔོ་མི་ཐོགས། །
en: “As I have been liberated by impurity After being stupefied by this young woman, I am not really able to say, Mañjughoṣa, What this is about.

source: མི་འགུམ་འཆི་འཕོ་མ་མཆིས་ཀྱང་། །སེམས་ཅན་ཡོངས་སྨིན་བགྱི་སླད་དུ། །བདག་ནི་འཆི་བར་སྟོན་བགྱིད་པས། །སུ་ཞིག་བྱང་ཆུབ་ཚོལ་མི་བགྱིད། །
en: “Although there is really no death and no transmigration, I will still manifest my death for the sake Of living beings who are coming to maturity, So that no one will fail to seek awakening.

source: ཇི་ལྟར་བདག་གིས་ཆགས་སྡང་དང་། །ཉོན་མོངས་ཐམས་ཅད་ཚུལ་བཞིན་མིན། །
en: “My desire, my aversion, And all my afflicted mental states are superficial.

source: སེམས་ཅན་ཀུན་གྱི་མཚན་དེ་འདྲ། །
en: The character of all beings is the same.

source: འདི་ནི་ཆོས་རྣམས་ཆོས་ཉིད་ལགས། །
en: This is the reality of all things.”

source: དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་འཛུམ་པ་མཛད་དོ། །
en: Then the Blessed One smiled.

source: འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་ཉིད་དེ། གང་གི་ཚེ་འཛུམ་པ་མཛད་པ་དེའི་ཚེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ནས་འོད་ཟེར་ཁ་དོག་སྣ་ཚོགས། ཁ་དོག་དུ་མ་འདི་ལྟ་སྟེ། སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། བཙོད་ཀ་དང་། ཤེལ་དང་། དངུལ་གྱི་ཁ་དོག་ལྟ་བུ་དག་བྱུང་སྟེ།
en: The nature of the Awakened One is such that when he smiles, light of many colors appears from the opening of his mouth: blue, yellow, red, white, rose, crystal, and silver.

source: དེ་དག་བྱུང་ནས་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་སོང་སྟེ། འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་དག་སྣང་བས་ཁྱབ་པར་བྱས་ནས།
en: When it had appeared, it reached all the way to the heaven of Brahmā and illuminated innumerable world spheres.

source: སླར་ལོག་སྟེ། བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་ཏུ་ནུབ་བོ། །
en: When it returned, it was absorbed into the crown of the Blessed One’s head.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་འཛུམ་པ་མཛད་པ་མཐོང་ནས་སྟན་ལས་ལངས་ཏེ།
en: Venerable Ānanda saw the Blessed One smile and approached his feet.

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: He put his robe over one shoulder and placed his right knee on the ground.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: He joined his palms, bowed his head toward the Blessed One in veneration, and addressed the Blessed One as follows:

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ནི་རྒྱུ་དང་རྐྱེན་མ་མཆིས་པར་འཛུམ་པ་མི་མཛད་ན།
en: “The tathāgatas, the worthy ones, the perfectly awakened ones do not smile without a specific reason and cause.

source: བཅོམ་ལྡན་འདས་འཛུམ་པ་མཛད་པའི་རྒྱུ་ནི་གང་ལགས། རྐྱེན་ནི་གང་ལགས།
en: So, Blessed One, what is the reason, what is the cause, for your smile?”

source: དེ་ནས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་ཀྱང་གསོལ་ཏོ། །
en: Then Ānanda spoke the following verses:

source: རྣམ་འདྲེན་འཇིག་རྟེན་མཁྱེན་ལ་ཡ་མཚན་མི་མངའ་བས། །སྟོན་པ་རྒྱུ་མ་མཆིས་པར་འཛུམ་པ་མི་མཛད་ན། །
en: “The Leader, the Knower of the World for whom there is no false doctrine, The Teacher does not smile without a cause.

source: འདི་ལྟར་ཁྱོད་ནི་འཛུམ་པར་མཛད་པར་གྱུར་པ་ཡི། །ཁྱོད་ཀྱི་འཛུམ་པའི་རྒྱུ་ནི་བདག་ཅག་ཤིན་ཏུ་འཚལ། །
en: Thus, since you have smiled, we ask you sincerely: What is the cause of your smile?

source: རྒྱལ་བའི་ཞལ་འཛུམ་མཛད་པར་གྱུར་པ་མཐོང་ནས་ནི། །ལྷར་བཅས་འགྲོ་བ་འདི་དག་ཐེ་ཙོམ་སྐྱེས་པར་གྱུར། །
en: “Having seen the smile of the Victorious One, Doubt has arisen in the world, even among the gods.

source: ཐེ་ཙོམ་གྱུར་པ་རྣམས་ཀྱི་སོམ་ཉི་བསལ་སླད་དུ། །
en: So we ask you to clear away the uncertainty of the doubtful.

source: མི་དབང་འཛུམ་པ་མཛད་པའི་རྒྱུ་ནི་བསྟན་དུ་གསོལ། །
en: Best among all human beings, please reveal to us the cause of your smile.

source: གང་གིས་དེ་རིང་ཆོས་རྣམས་ལ་ནི་ཡིད་བཞག་གམ། །
en: “Who are those who have set their minds on the Dharma?

source: ཆོས་ཉིད་དུ་ནི་རྒྱལ་བ་ལ་ལས་མཐོང་གྱུར་ཏམ། །
en: Who are the ones who in reality have been seen by the victorious ones?

source: སངས་རྒྱས་བསྔགས་པའི་མཆོད་པ་གང་གིས་དེང་བགྱིས་སམ། །བདག་ཅག་དེ་དག་ཉན་པར་འཚལ་ལོ་མི་ཡི་གཙོ། །
en: Who are those who have made offerings to the Awakened One and praised him today? This is what we wish to hear.

source: གང་གིས་དེ་རིང་བདུད་རྣམས་བཞོན་དང་བཅས་བཅོམ་མམ། །
en: “Who are those who have defeated Māra and his forces?

source: གང་གིས་སྟོན་པའི་ཐུགས་ནི་དེ་རིང་དགྱེས་བགྱིས་སམ། །
en: Who has satisfied the mind of our teacher today?
